In [2]:
import pandas as pd
import numpy as np

# 创建Series

In [3]:
pd.Series(data=np.arange(0,10,1))

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [4]:
pd.Series(data=[1,2,3,4],index=['第一行','第二行','第三行','第四行'])

第一行    1
第二行    2
第三行    3
第四行    4
dtype: int64

In [6]:
# 通过字典数据创建
coles = pd.Series({'red':100,'blue':200,'green':300})

In [7]:
coles['red']

100

In [8]:
coles[0]

100

# Series 属性

In [9]:
coles.index

Index(['red', 'blue', 'green'], dtype='object')

In [10]:
coles.values

array([100, 200, 300])

# Dataframe 创建

In [14]:
# 生成2,3 服从正太分布Dataframe
pd.DataFrame(data=np.random.randn(2,3))

          0         1         2
0 -1.076728 -0.224316  0.247591
1 -0.594987  0.746647  1.138235

In [16]:
# 生成10名同学，5门功课的数据
score = np.random.randint(0,100,(10,5))

In [21]:
data = pd.DataFrame(score,columns=['语文','数学','英语','物理','化学'],index=['同学'+str(i) for i in range(score.shape[0])])

In [19]:
score.shape[0]

10

# Dataframe属性

In [23]:
data

     语文  数学  英语  物理  化学
同学0  63  13   7  32  48
同学1  61  29  30  54  28
同学2  88  66  31  82  26
同学3   0   6  40  83  90
同学4  59  61  75  54  11
同学5  83  91  93  16  44
同学6  19  53  69  35  74
同学7  26  11  64  64   1
同学8  86  25  27   0  37
同学9  30  29  32  99  63

In [22]:
data.shape

(10, 5)

In [24]:
data.index

Index(['同学0', '同学1', '同学2', '同学3', '同学4', '同学5', '同学6', '同学7', '同学8', '同学9'], dtype='object')

In [25]:
data.columns

Index(['语文', '数学', '英语', '物理', '化学'], dtype='object')

In [26]:
data.values

array([[63, 13,  7, 32, 48],
       [61, 29, 30, 54, 28],
       [88, 66, 31, 82, 26],
       [ 0,  6, 40, 83, 90],
       [59, 61, 75, 54, 11],
       [83, 91, 93, 16, 44],
       [19, 53, 69, 35, 74],
       [26, 11, 64, 64,  1],
       [86, 25, 27,  0, 37],
       [30, 29, 32, 99, 63]])

In [27]:
data.T

    同学0  同学1  同学2  同学3  同学4  同学5  同学6  同学7  同学8  同学9
语文   63   61   88    0   59   83   19   26   86   30
数学   13   29   66    6   61   91   53   11   25   29
英语    7   30   31   40   75   93   69   64   27   32
物理   32   54   82   83   54   16   35   64    0   99
化学   48   28   26   90   11   44   74    1   37   63

In [29]:
data.head(2)

     语文  数学  英语  物理  化学
同学0  63  13   7  32  48
同学1  61  29  30  54  28

In [31]:
data.tail(2)

     语文  数学  英语  物理  化学
同学8  86  25  27   0  37
同学9  30  29  32  99  63

## 修改行索引

In [33]:
data.index = ['学生_'+str(i) for i in range(score.shape[0])]

In [34]:
data

      语文  数学  英语  物理  化学
学生_0  63  13   7  32  48
学生_1  61  29  30  54  28
学生_2  88  66  31  82  26
学生_3   0   6  40  83  90
学生_4  59  61  75  54  11
学生_5  83  91  93  16  44
学生_6  19  53  69  35  74
学生_7  26  11  64  64   1
学生_8  86  25  27   0  37
学生_9  30  29  32  99  63

In [35]:
data.index[2] = '学生'

TypeError: Index does not support mutable operations

## 重设索引

In [38]:
data.reset_index()

  index  语文  数学  英语  物理  化学
0  学生_0  63  13   7  32  48
1  学生_1  61  29  30  54  28
2  学生_2  88  66  31  82  26
3  学生_3   0   6  40  83  90
4  学生_4  59  61  75  54  11
5  学生_5  83  91  93  16  44
6  学生_6  19  53  69  35  74
7  学生_7  26  11  64  64   1
8  学生_8  86  25  27   0  37
9  学生_9  30  29  32  99  63

In [39]:
data.reset_index(drop=True)

   语文  数学  英语  物理  化学
0  63  13   7  32  48
1  61  29  30  54  28
2  88  66  31  82  26
3   0   6  40  83  90
4  59  61  75  54  11
5  83  91  93  16  44
6  19  53  69  35  74
7  26  11  64  64   1
8  86  25  27   0  37
9  30  29  32  99  63

## 以某一列为新的索引

In [40]:
df = pd.DataFrame({'month': [1, 4, 7, 10],
                    'year': [2012, 2014, 2013, 2014],
                    'sale':[55, 40, 84, 31]})

In [42]:
df.set_index(['month'])

       year  sale
month
1      2012    55
4      2014    40
7      2013    84
10     2014    31

In [43]:
df

   month  year  sale
0      1  2012    55
1      4  2014    40
2      7  2013    84
3     10  2014    31

In [45]:
# 多个列名为索引
df = df.set_index(['year','month'])

# MultiIndex

In [46]:
df.index

MultiIndex(levels=[[2012, 2013, 2014], [1, 4, 7, 10]],
           labels=[[0, 2, 1, 2], [0, 1, 2, 3]],
           names=['year', 'month'])

## 获取属性内容

In [48]:
df.index.names

FrozenList(['year', 'month'])

In [49]:
df.index.levels

FrozenList([[2012, 2013, 2014], [1, 4, 7, 10]])

In [50]:
df.index.labels

FrozenList([[0, 2, 1, 2], [0, 1, 2, 3]])

## 如何创建Mutiindex

In [51]:
arrays = [[1, 1, 2, 2], ['red', 'blue', 'red', 'blue']]

In [53]:
newmuti = pd.MultiIndex.from_arrays(arrays,names=['number','color'])

In [54]:
pd.DataFrame(data=np.random.randn(4,4),index=newmuti)

                     0         1         2         3
number color
1      red   -1.271283  0.347700 -1.901419  0.106862
       blue   0.451925  0.554306 -1.482676 -0.321581
2      red   -1.283757 -0.841756 -0.254328 -0.616572
       blue   1.366028  1.245686  0.897232 -1.544981

##  Panel

In [55]:
p = pd.Panel(data=np.arange(24).reshape(4,3,2),
                 items=list('ABCD'),
                 major_axis=pd.date_range('20130101', periods=3),
                 minor_axis=['first', 'second'])

/anaconda3/lib/python3.6/site-packages/IPython/core/interactiveshell.py:2963: FutureWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  exec(code_obj, self.user_global_ns, self.user_ns)

In [57]:
p['A',:,:]

            first  second
2013-01-01      0       1
2013-01-02      2       3
2013-01-03      4       5

In [58]:
p[:,:,'first']

            A   B   C   D
2013-01-01  0   6  12  18
2013-01-02  2   8  14  20
2013-01-03  4  10  16  22